# GetEnumerator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConduitSizes..::..GetEnumerator Method
ConduitSizes Class See Also
---
Returns an enumerator that iterates through a collection.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual IEnumerator<ConduitSize> GetEnumerator()
```

Visual Basic
---
```text
Public Overridable Function GetEnumerator As IEnumerator(Of ConduitSize)
```

Visual C++
---
```text
public:
virtual IEnumerator<ConduitSize^>^ GetEnumerator()
```

# ### Return Value
An IEnumerator object that can be used to iterate through the collection.
# ### Implements
IEnumerable<(Of <(<'T>)>)>..::..GetEnumerator()()()()
# See Also
ConduitSizes Class
Autodesk.Revit.DB.Electrical Namespace